// Найти третью цифру числа или сообщить, что её нет

Console.Write("Введите трехзначное число: ");
int num = int.Parse(Console.ReadLine());
Console.WriteLine(num);
int A = num % 100;
if(x > 1)
{
    
}
else
{
    Console.WriteLine("Error");
}